; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v2 - type_2 ?v4 - type_1)
 	      (pred_4 ?v3 - object ?v4 - type_1)
	      (pred_1 ?v2 - type_2 ?v6 - type_3)
	      (pred_2 ?v2 - type_2 ?v3 - object ?v6 - type_3))

   (:action op_1
       :parameters  (?v2 - type_2 ?v1 ?v8 - type_1)
       :precondition (and  (pred_3 ?v2 ?v1))
       :effect (and  (pred_3 ?v2 ?v8)
		     (not (pred_3 ?v2 ?v1))))

   (:action op_2
       :parameters (?v2 - type_2 ?v7 - object ?v5 - type_1 ?v6 - type_3)
       :precondition  (and  (pred_4 ?v7 ?v5) (pred_3 ?v2 ?v5) (pred_1 ?v2 ?v6))
       :effect (and (pred_2 ?v2 ?v7 ?v6)
		    (not (pred_4 ?v7 ?v5)) 
		    (not (pred_1 ?v2 ?v6))))

   (:action op_3
       :parameters (?v2 - type_2 ?v7 - object ?v5 - type_1 ?v6 - type_3)
       :precondition  (and  (pred_2 ?v2 ?v7 ?v6) (pred_3 ?v2 ?v5))
       :effect (and (pred_4 ?v7 ?v5)
		    (pred_1 ?v2 ?v6)
		    (not (pred_2 ?v2 ?v7 ?v6)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_08 obj_05 - type_2
obj_14 obj_07 obj_03 obj_09 - type_3
obj_12 obj_10 obj_13 obj_11 - type_1
obj_02 obj_04 obj_01 obj_06 - object)
(:init
(pred_3 obj_08 obj_12)
(pred_1 obj_08 obj_14)
(pred_1 obj_08 obj_07)
(pred_3 obj_05 obj_10)
(pred_1 obj_05 obj_03)
(pred_1 obj_05 obj_09)
(pred_4 obj_02 obj_13)
(pred_4 obj_04 obj_12)
(pred_4 obj_01 obj_13)
(pred_4 obj_06 obj_11)
)
(:goal
(and
(pred_4 obj_02 obj_10)
(pred_4 obj_04 obj_12)
(pred_4 obj_01 obj_13)
(pred_4 obj_06 obj_13)
)
)

(:constraints
  (always (not (pred_3 obj_08 obj_13)))
)
)

; plan
1. (op_1 obj_08 obj_12 obj_11)
   deleted: (pred_3 obj_08 obj_12)
   added: (pred_3 obj_08 obj_11)
   goals met: 2 of 4
2. (op_1 obj_05 obj_10 obj_13)
   deleted: (pred_3 obj_05 obj_10)
   added: (pred_3 obj_05 obj_13)
   goals met: 2 of 4
3. (op_2 obj_08 obj_06 obj_11 obj_07)
   deleted: (pred_4 obj_06 obj_11) (pred_1 obj_08 obj_07)
   added: (pred_2 obj_08 obj_06 obj_07)
   goals met: 2 of 4
4. (op_2 obj_05 obj_02 obj_13 obj_09)
   deleted: (pred_4 obj_02 obj_13) (pred_1 obj_05 obj_09)
   added: (pred_2 obj_05 obj_02 obj_09)
   goals met: 2 of 4
5. (op_1 obj_05 obj_13 obj_10)
   deleted: (pred_3 obj_05 obj_13)
   added: (pred_3 obj_05 obj_10)
   goals met: 2 of 4
6. (op_3 obj_08 obj_06 obj_11 obj_07)
   deleted: (pred_2 obj_08 obj_06 obj_07)
   added: (pred_4 obj_06 obj_11) (pred_1 obj_08 obj_07)
   goals met: 2 of 4
7. (op_3 obj_05 obj_02 obj_10 obj_09)
   deleted: (pred_2 obj_05 obj_02 obj_09)
   added: (pred_4 obj_02 obj_10) (pred_1 obj_05 obj_09)
   goals met: 3 of 4
8. (op_1 obj_05 obj_10 obj_11)
   deleted: (pred_3 obj_05 obj_10)
   added: (pred_3 obj_05 obj_11)
   goals met: 3 of 4
9. (op_2 obj_05 obj_06 obj_11 obj_09)
   deleted: (pred_4 obj_06 obj_11) (pred_1 obj_05 obj_09)
   added: (pred_2 obj_05 obj_06 obj_09)
   goals met: 3 of 4
10. (op_1 obj_05 obj_11 obj_13)
   deleted: (pred_3 obj_05 obj_11)
   added: (pred_3 obj_05 obj_13)
   goals met: 3 of 4
11. (op_3 obj_05 obj_06 obj_13 obj_09)
   deleted: (pred_2 obj_05 obj_06 obj_09)
   added: (pred_4 obj_06 obj_13) (pred_1 obj_05 obj_09)
   goals met: 4 of 4
